martijnschouten/OCHVPS_FW/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_UART0RXSRC_UART_RX 0x00u /*!<@brief UART 0 receive data source select: UART0_RX pin */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name VDD5 (number 5), VDD_005
  @{ */
/* @} */

/*! @name VSS6 (number 6), VSS_006
  @{ */
/* @} */

/*! @name VDD16 (number 16), VDD_016
  @{ */
/* @} */

/*! @name VSS17 (number 17), VSS_017
  @{ */
/* @} */

/*! @name VSS22 (number 18), VSS_018
  @{ */
/* @} */

/*! @name USB0_DP (number 19), USB_P
  @{ */
/* @} */

/*! @name USB0_DM (number 20), USB_N
  @{ */
/* @} */

/*! @name VOUT33 (number 21), VOUT33
  @{ */
/* @} */

/*! @name VREGIN (number 22), USB_VBUS
  @{ */
/* @} */

/*! @name ADC0_DP0 (number 27), PS_HV_CM_P
  @{ */
/* @} */

/*! @name ADC0_DM0 (number 28), PS_HV_CM_N
  @{ */
/* @} */

/*! @name VDDA (number 31), VDDA_031
  @{ */
/* @} */

/*! @name VREFH (number 32), VREFH_032
  @{ */
/* @} */

/*! @name VREFL (number 33), VREFL_033
  @{ */
/* @} */

/*! @name VSSA (number 34), VSSA_034
  @{ */
/* @} */

/*! @name VBAT (number 42), VBAT_42
  @{ */
/* @} */

/*! @name VDD54 (number 43), VDD54_043
  @{ */
/* @} */

/*! @name VSS55 (number 44), VSS55_044
  @{ */
/* @} */

/*! @name PORTE24 (number 45), PS_12V_VM
  @{ */

/* Symbols to be used with PORT driver */
#define PS_12V_VM_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define PS_12V_VM_PIN 24U                   /*!<@brief PORT pin number */
#define PS_12V_VM_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTE25 (number 46), PS_HV_VM
  @{ */

/* Symbols to be used with PORT driver */
#define PS_HV_VM_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define PS_HV_VM_PIN 25U                   /*!<@brief PORT pin number */
#define PS_HV_VM_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTA0 (number 50), JTAG_TCLK
  @{ */

/* Symbols to be used with PORT driver */
#define JTAG_TCLK_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define JTAG_TCLK_PIN 0U                   /*!<@brief PORT pin number */
#define JTAG_TCLK_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTA1 (number 51), JTAG_TDI
  @{ */

/* Symbols to be used with PORT driver */
#define JTAG_TDI_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define JTAG_TDI_PIN 1U                   /*!<@brief PORT pin number */
#define JTAG_TDI_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTA2 (number 52), JTAG_TDO
  @{ */

/* Symbols to be used with PORT driver */
#define JTAG_TDO_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define JTAG_TDO_PIN 2U                   /*!<@brief PORT pin number */
#define JTAG_TDO_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTA3 (number 53), JTAG_TMS
  @{ */

/* Symbols to be used with PORT driver */
#define JTAG_TMS_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define JTAG_TMS_PIN 3U                   /*!<@brief PORT pin number */
#define JTAG_TMS_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name VDD67 (number 56), VDD_056
  @{ */
/* @} */

/*! @name VSS68 (number 57), VSS_057
  @{ */
/* @} */

/*! @name PORTA13 (number 65), PS_HV_EN
  @{ */

/* Symbols to be used with GPIO driver */
#define PS_HV_EN_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define PS_HV_EN_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PS_HV_EN_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define PS_HV_EN_PIN 13U                   /*!<@brief PORT pin number */
#define PS_HV_EN_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTA14 (number 66), USB_UART_TX
  @{ */

/* Symbols to be used with PORT driver */
#define USB_UART_TX_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define USB_UART_TX_PIN 14U                   /*!<@brief PORT pin number */
#define USB_UART_TX_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTA15 (number 67), USB_UART_RX
  @{ */

/* Symbols to be used with PORT driver */
#define USB_UART_RX_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define USB_UART_RX_PIN 15U                   /*!<@brief PORT pin number */
#define USB_UART_RX_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name VDD81 (number 70), VDD_070
  @{ */
/* @} */

/*! @name VSS82 (number 71), VSS_071
  @{ */
/* @} */

/*! @name PORTA18 (number 72), EXTAL0
  @{ */

/* Symbols to be used with PORT driver */
#define EXTAL0_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define EXTAL0_PIN 18U                   /*!<@brief PORT pin number */
#define EXTAL0_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTA19 (number 73), XTAL0
  @{ */

/* Symbols to be used with PORT driver */
#define XTAL0_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define XTAL0_PIN 19U                   /*!<@brief PORT pin number */
#define XTAL0_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name RESET_b (number 74), RESET_b
  @{ */
/* @} */

/*! @name PORTB0 (number 81), HB_CM_CH1
  @{ */

/* Symbols to be used with PORT driver */
#define HB_CM_CH1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define HB_CM_CH1_PIN 0U                   /*!<@brief PORT pin number */
#define HB_CM_CH1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTB1 (number 82), HB_CM_CH2
  @{ */

/* Symbols to be used with PORT driver */
#define HB_CM_CH2_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define HB_CM_CH2_PIN 1U                   /*!<@brief PORT pin number */
#define HB_CM_CH2_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                           /* @} */

