martijnschouten/OCHVPS_FW/board/pin_mux.h
/*! @name PORTB2 (number 83), EEPROM_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define EEPROM_SCL_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define EEPROM_SCL_PIN 2U                   /*!<@brief PORT pin number */
#define EEPROM_SCL_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB3 (number 84), EEPROM_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define EEPROM_SDA_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define EEPROM_SDA_PIN 3U                   /*!<@brief PORT pin number */
#define EEPROM_SDA_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB4 (number 85), HB_CM_CH3
  @{ */

/* Symbols to be used with PORT driver */
#define HB_CM_CH3_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define HB_CM_CH3_PIN 4U                   /*!<@brief PORT pin number */
#define HB_CM_CH3_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTB5 (number 86), HB_CM_CH4
  @{ */

/* Symbols to be used with PORT driver */
#define HB_CM_CH4_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define HB_CM_CH4_PIN 5U                   /*!<@brief PORT pin number */
#define HB_CM_CH4_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTB6 (number 87), HB_CM_CH5
  @{ */

/* Symbols to be used with PORT driver */
#define HB_CM_CH5_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define HB_CM_CH5_PIN 6U                   /*!<@brief PORT pin number */
#define HB_CM_CH5_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTB7 (number 88), HB_CM_CH6
  @{ */

/* Symbols to be used with PORT driver */
#define HB_CM_CH6_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define HB_CM_CH6_PIN 7U                   /*!<@brief PORT pin number */
#define HB_CM_CH6_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTB10 (number 91), HB_CM_CH7
  @{ */

/* Symbols to be used with PORT driver */
#define HB_CM_CH7_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define HB_CM_CH7_PIN 10U                   /*!<@brief PORT pin number */
#define HB_CM_CH7_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB11 (number 92), HB_CM_CH8
  @{ */

/* Symbols to be used with PORT driver */
#define HB_CM_CH8_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define HB_CM_CH8_PIN 11U                   /*!<@brief PORT pin number */
#define HB_CM_CH8_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name VSS104 (number 93), VSS_093
  @{ */
/* @} */

/*! @name VDD105 (number 94), VDD_094
  @{ */
/* @} */

/*! @name PORTC3 (number 106), SIM_CLKOUT
  @{ */

/* Symbols to be used with PORT driver */
#define SIM_CLKOUT_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define SIM_CLKOUT_PIN 3U                   /*!<@brief PORT pin number */
#define SIM_CLKOUT_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name VSS118 (number 107), VSS_107
  @{ */
/* @} */

/*! @name VDD119 (number 108), VDD_108
  @{ */
/* @} */

/*! @name PORTC9 (number 114), PS_SW_STATE
  @{ */

/* Symbols to be used with GPIO driver */
#define PS_SW_STATE_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define PS_SW_STATE_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PS_SW_STATE_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define PS_SW_STATE_PIN 9U                   /*!<@brief PORT pin number */
#define PS_SW_STATE_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC10 (number 115), PS_12V_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define PS_12V_SCL_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define PS_12V_SCL_PIN 10U                   /*!<@brief PORT pin number */
#define PS_12V_SCL_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC11 (number 116), PS_12V_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define PS_12V_SDA_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define PS_12V_SDA_PIN 11U                   /*!<@brief PORT pin number */
#define PS_12V_SDA_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC12 (number 117), PS_12V_EN
  @{ */

/* Symbols to be used with GPIO driver */
#define PS_12V_EN_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define PS_12V_EN_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PS_12V_EN_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define PS_12V_EN_PIN 12U                   /*!<@brief PORT pin number */
#define PS_12V_EN_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name VSS137 (number 121), VSS_121
  @{ */
/* @} */

/*! @name VDD138 (number 122), VDD_122
  @{ */
/* @} */

/*! @name PORTD0 (number 127), HB_LG1
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_LG1_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_LG1_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_LG1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_LG1_PIN 0U                   /*!<@brief PORT pin number */
#define HB_LG1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                        /* @} */

