martijnschouten/OCHVPS_FW/board/pin_mux.h
/*! @name PORTD1 (number 128), HB_HG1
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_HG1_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_HG1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_HG1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_HG1_PIN 1U                   /*!<@brief PORT pin number */
#define HB_HG1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD2 (number 129), HB_LG2
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_LG2_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_LG2_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_LG2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_LG2_PIN 2U                   /*!<@brief PORT pin number */
#define HB_LG2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD3 (number 130), HB_HG2
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_HG2_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_HG2_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_HG2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_HG2_PIN 3U                   /*!<@brief PORT pin number */
#define HB_HG2_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD4 (number 131), HB_LG3
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_LG3_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_LG3_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_LG3_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_LG3_PIN 4U                   /*!<@brief PORT pin number */
#define HB_LG3_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD5 (number 132), HB_HG3
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_HG3_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_HG3_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_HG3_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_HG3_PIN 5U                   /*!<@brief PORT pin number */
#define HB_HG3_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD6 (number 133), HB_LG4
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_LG4_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_LG4_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_LG4_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_LG4_PIN 6U                   /*!<@brief PORT pin number */
#define HB_LG4_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name VSS150 (number 134), VSS_134
  @{ */
/* @} */

/*! @name VDD151 (number 135), VDD_135
  @{ */
/* @} */

/*! @name PORTD7 (number 136), HB_HG4
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_HG4_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_HG4_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_HG4_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_HG4_PIN 7U                   /*!<@brief PORT pin number */
#define HB_HG4_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD8 (number 137), HB_LG5
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_LG5_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_LG5_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_LG5_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_LG5_PIN 8U                   /*!<@brief PORT pin number */
#define HB_LG5_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD9 (number 138), HB_HG5
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_HG5_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_HG5_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_HG5_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_HG5_PIN 9U                   /*!<@brief PORT pin number */
#define HB_HG5_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD10 (number 139), HB_LG6
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_LG6_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define HB_LG6_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_LG6_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define HB_LG6_PIN 10U                   /*!<@brief PORT pin number */
#define HB_LG6_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTD11 (number 140), HB_HG6
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_HG6_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define HB_HG6_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_HG6_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define HB_HG6_PIN 11U                   /*!<@brief PORT pin number */
#define HB_HG6_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                         /* @} */

