martijnschouten/OCHVPS_FW/board/pin_mux.h
/*! @name PORTD12 (number 141), HB_LG7
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_LG7_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define HB_LG7_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_LG7_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define HB_LG7_PIN 12U                   /*!<@brief PORT pin number */
#define HB_LG7_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTD13 (number 142), HB_HG7
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_HG7_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define HB_HG7_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_HG7_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define HB_HG7_PIN 13U                   /*!<@brief PORT pin number */
#define HB_HG7_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTD14 (number 143), HB_LG8
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_LG8_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define HB_LG8_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_LG8_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define HB_LG8_PIN 14U                   /*!<@brief PORT pin number */
#define HB_LG8_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTD15 (number 144), HB_HG8
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_HG8_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define HB_HG8_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_HG8_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define HB_HG8_PIN 15U                   /*!<@brief PORT pin number */
#define HB_HG8_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
